hathach/tinyusb/src/portable/silabs/efm32/dcd_efm32.c
/* 
 * The MIT License (MIT)
 *
 * Copyright (c) 2021 Rafael Silva (@perigoso)
 * Copyright (c) 2021 Ha Thach (tinyusb.org)
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 *
 * This file is part of the TinyUSB stack.
 */

#include "tusb_option.h"

#if TUSB_OPT_DEVICE_ENABLED && ( \
  (CFG_TUSB_MCU == OPT_MCU_EFM32GG) || \
  (CFG_TUSB_MCU == OPT_MCU_EFM32GG11) || \
  (CFG_TUSB_MCU == OPT_MCU_EFM32GG12) )

/* Silabs */
#include "em_device.h"

#include "device/dcd.h"

/* 
 * Since TinyUSB doesn't use SOF for now, and this interrupt too often (1ms interval)
 * We disable SOF for now until needed later on
 */
#define USE_SOF     0

/* 
 * Number of endpoints
 * 12 software-configurable endpoints (6 IN, 6 OUT) in addition to endpoint 0
 */
#define EP_COUNT        7

/* FIFO size in bytes */
#define EP_FIFO_SIZE    2048

/* Max number of IN EP FIFOs */
#define EP_FIFO_NUM     7

/* */
typedef struct {
    uint8_t *buffer;
    uint16_t total_len;
    uint16_t queued_len;
    uint16_t max_size;
    bool short_packet;
} xfer_ctl_t;

static uint32_t _setup_packet[2];

#define XFER_CTL_BASE(_ep, _dir) &xfer_status[_ep][_dir]
static xfer_ctl_t xfer_status[EP_COUNT][2];

/* Keep count of how many FIFOs are in use */
static uint8_t _allocated_fifos = 1; /* FIFO0 is always in use */

static volatile uint32_t* tx_fifo[EP_FIFO_NUM] = {
  USB->FIFO0D,
  USB->FIFO1D,
  USB->FIFO2D,
  USB->FIFO3D,
  USB->FIFO4D,
  USB->FIFO5D,
  USB->FIFO6D,
};

/* Register Helpers */
#define DCTL_WO_BITMASK     (USB_DCTL_CGOUTNAK | USB_DCTL_SGOUTNAK | USB_DCTL_CGNPINNAK | USB_DCTL_SGNPINNAK)
#define GUSBCFG_WO_BITMASK  (USB_GUSBCFG_CORRUPTTXPKT)
#define DEPCTL_WO_BITMASK   (USB_DIEP_CTL_CNAK | USB_DIEP_CTL_SNAK | USB_DIEP_CTL_SETD0PIDEF | USB_DIEP_CTL_SETD1PIDOF)

/* Will either return an unused FIFO number, or 0 if all are used. */
static uint8_t get_free_fifo(void)
{
  if(_allocated_fifos < EP_FIFO_NUM) return _allocated_fifos++;
  return 0;
}

/*
static void flush_rx_fifo(void)
{
  USB->GRSTCTL = USB_GRSTCTL_RXFFLSH;
  while(USB->GRSTCTL & USB_GRSTCTL_RXFFLSH);
} 
*/

static void flush_tx_fifo(uint8_t fifo_num)
{
  USB->GRSTCTL = USB_GRSTCTL_TXFFLSH | (fifo_num << _USB_GRSTCTL_TXFNUM_SHIFT);
  while(USB->GRSTCTL & USB_GRSTCTL_TXFFLSH);
}

/* Setup the control endpoint 0. */
static void bus_reset(void)
{
  USB->DOEP0CTL |= USB_DIEP_CTL_SNAK;
  for(uint8_t i = 0; i < EP_COUNT - 1; i++)
  {
    USB->DOEP[i].CTL |= USB_DIEP_CTL_SNAK;
  }
  
  /* reset address */
  USB->DCFG &= ~_USB_DCFG_DEVADDR_MASK;

  USB->DAINTMSK |= USB_DAINTMSK_OUTEPMSK0 | USB_DAINTMSK_INEPMSK0;
  USB->DOEPMSK |= USB_DOEPMSK_SETUPMSK | USB_DOEPMSK_XFERCOMPLMSK;
  USB->DIEPMSK |= USB_DIEPMSK_TIMEOUTMSK | USB_DIEPMSK_XFERCOMPLMSK;

  /* 
   * - All EP OUT shared a unique OUT FIFO which uses
   *   * 10 locations in hardware for setup packets + setup control words (up to 3 setup packets).
   *   * 2 locations for OUT endpoint control words.
   *   * 16 for largest packet size of 64 bytes. ( TODO Highspeed is 512 bytes)
   *   * 1 location for global NAK (not required/used here).
   *   * It is recommended to allocate 2 times the largest packet size, therefore
   *  Recommended value = 10 + 1 + 2 x (16+2) = 47 --> Let's make it 52
   */
  flush_tx_fifo(_USB_GRSTCTL_TXFNUM_FALL);  // Flush All
  USB->GRXFSIZ = 52;

  /* Control IN uses FIFO 0 with 64 bytes ( 16 32-bit word ) */
  USB->GNPTXFSIZ = (16 << _USB_GNPTXFSIZ_NPTXFINEPTXF0DEP_SHIFT) | (USB->GRXFSIZ & _USB_GNPTXFSIZ_NPTXFSTADDR_MASK);

  /* Ready to receive SETUP packet */
  USB->DOEP0TSIZ |= (1 << _USB_DOEP0TSIZ_SUPCNT_SHIFT);

  USB->GINTMSK |= USB_GINTMSK_IEPINTMSK | USB_GINTMSK_OEPINTMSK;
}

static void enum_done_processing(void)
{
  /* Maximum packet size for EP 0 is set for both directions by writing DIEPCTL */
  if((USB->DSTS & _USB_DSTS_ENUMSPD_MASK) == USB_DSTS_ENUMSPD_FS)
  { 
    /* Full Speed (PHY on 48 MHz) */
    USB->DOEP0CTL = (USB->DOEP0CTL & ~_USB_DOEP0CTL_MPS_MASK) | _USB_DOEP0CTL_MPS_64B; /* Maximum Packet Size 64 bytes */
    USB->DOEP0CTL &= ~_USB_DOEP0CTL_STALL_MASK; /* clear Stall */
    xfer_status[0][TUSB_DIR_OUT].max_size = 64;
    xfer_status[0][TUSB_DIR_IN].max_size = 64;
  }
  else
  { 
    /* Low Speed (PHY on 6 MHz) */
    USB->DOEP0CTL = (USB->DOEP0CTL & ~_USB_DOEP0CTL_MPS_MASK) | _USB_DOEP0CTL_MPS_8B; /* Maximum Packet Size 64 bytes */
    USB->DOEP0CTL &= ~_USB_DOEP0CTL_STALL_MASK; /* clear Stall */
    xfer_status[0][TUSB_DIR_OUT].max_size = 8;
    xfer_status[0][TUSB_DIR_IN].max_size = 8;
  }
}


/*------------------------------------------------------------------*/
/* Controller API                                                   */
/*------------------------------------------------------------------*/
void dcd_init(uint8_t rhport)
{
  (void) rhport;

  /* Reset Core */
  USB->PCGCCTL &= ~USB_PCGCCTL_STOPPCLK;
  USB->PCGCCTL &= ~(USB_PCGCCTL_PWRCLMP | USB_PCGCCTL_RSTPDWNMODULE);

  /* Core Soft Reset */
  USB->GRSTCTL |= USB_GRSTCTL_CSFTRST;
  while(USB->GRSTCTL & USB_GRSTCTL_CSFTRST);

