hathach/tinyusb/src/portable/silabs/efm32/dcd_efm32.c
  while(!(USB->GRSTCTL & USB_GRSTCTL_AHBIDLE));

  /* Enable PHY pins */
  USB->ROUTE = USB_ROUTE_PHYPEN;

  dcd_disconnect(rhport);

  /* 
   * Set device speed (Full speed PHY)
   * Stall on non-zero len status OUT packets (ctrl transfers)
   * periodic frame interval to 80% 
   */
  USB->DCFG = (USB->DCFG & ~(_USB_DCFG_DEVSPD_MASK | _USB_DCFG_PERFRINT_MASK)) | USB_DCFG_DEVSPD_FS | USB_DCFG_NZSTSOUTHSHK;
  
  /* Enable Global Interrupts */
  USB->GAHBCFG = (USB->GAHBCFG & ~_USB_GAHBCFG_HBSTLEN_MASK) | USB_GAHBCFG_GLBLINTRMSK;

  /* Force Device Mode */
  USB->GUSBCFG = (USB->GUSBCFG & ~(GUSBCFG_WO_BITMASK | USB_GUSBCFG_FORCEHSTMODE)) | USB_GUSBCFG_FORCEDEVMODE;

  /* No Overrides */
  USB->GOTGCTL &= ~(USB_GOTGCTL_BVALIDOVVAL | USB_GOTGCTL_BVALIDOVEN | USB_GOTGCTL_VBVALIDOVVAL);

  /* Ignore frame numbers on ISO transfers. */
  USB->DCTL = (USB->DCTL & ~DCTL_WO_BITMASK) | USB_DCTL_IGNRFRMNUM;

  /* Setting SNAKs */
  USB->DOEP0CTL |= USB_DIEP_CTL_SNAK;
  for(uint8_t i = 0; i < EP_COUNT - 1; i++)
  {
    USB->DOEP[i].CTL |= USB_DIEP_CTL_SNAK;
  }

  /* D. Interruption masking */
  /* Disable all device interrupts */
  USB->DIEPMSK  = 0;
  USB->DOEPMSK  = 0;
  USB->DAINTMSK = 0;
  USB->DIEPEMPMSK = 0;
  USB->GINTMSK = 0;
  USB->GOTGINT = ~0U; /* clear OTG ints */
  USB->GINTSTS = ~0U; /* clear pending ints */
  USB->GINTMSK = USB_GINTMSK_MODEMISMSK  |
              #if USE_SOF
                 USB_GINTMSK_SOFMSK      |
              #endif
                 USB_GINTMSK_ERLYSUSPMSK |
                 USB_GINTMSK_USBSUSPMSK  |
                 USB_GINTMSK_USBRSTMSK   |
                 USB_GINTMSK_ENUMDONEMSK |
                 USB_GINTMSK_RESETDETMSK |
                 USB_GINTMSK_DISCONNINTMSK;

  NVIC_ClearPendingIRQ(USB_IRQn);

  dcd_connect(rhport);
}

void dcd_set_address(uint8_t rhport, uint8_t dev_addr)
{
  (void) rhport;

  USB->DCFG = (USB->DCFG & ~_USB_DCFG_DEVADDR_MASK) | (dev_addr << _USB_DCFG_DEVADDR_SHIFT);

  /* Response with status after changing device address */
  dcd_edpt_xfer(rhport, tu_edpt_addr(0, TUSB_DIR_IN), NULL, 0);
}

void dcd_remote_wakeup(uint8_t rhport)
{
  (void) rhport;
}

void dcd_connect(uint8_t rhport)
{
  (void) rhport;

  /* connect by enabling internal pull-up resistor on D+/D- */
  USB->DCTL &= ~(DCTL_WO_BITMASK | USB_DCTL_SFTDISCON);
}

void dcd_disconnect(uint8_t rhport)
{
  (void) rhport;

  /* disconnect by disabling internal pull-up resistor on D+/D- */
  USB->DCTL = (USB->DCTL & ~(DCTL_WO_BITMASK)) | USB_DCTL_SFTDISCON;
}

/*------------------------------------------------------------------*/
/* DCD Endpoint Port                                                */
/*------------------------------------------------------------------*/
void dcd_edpt_stall(uint8_t rhport, uint8_t ep_addr)
{
  (void) rhport;

  uint8_t const epnum = tu_edpt_number(ep_addr);
  uint8_t const dir = tu_edpt_dir(ep_addr);

  if(dir == TUSB_DIR_IN)
  {
    if(epnum == 0)
    {
      USB->DIEP0CTL = (USB->DIEP0CTL & ~DEPCTL_WO_BITMASK) | USB_DIEP0CTL_SNAK | USB_DIEP0CTL_STALL;

      flush_tx_fifo(_USB_GRSTCTL_TXFNUM_F0);
    }
    else
    {
      /* Only disable currently enabled non-control endpoint */
      if(USB->DIEP[epnum - 1].CTL & USB_DIEP_CTL_EPENA) 
      {
        USB->DIEP[epnum - 1].CTL = (USB->DIEP[epnum - 1].CTL & ~DEPCTL_WO_BITMASK) | USB_DIEP_CTL_EPDIS | USB_DIEP_CTL_SNAK | USB_DIEP_CTL_STALL;
        while(!(USB->DIEP[epnum - 1].INT & USB_DIEP_INT_EPDISBLD));
        USB->DIEP[epnum - 1].INT |= USB_DIEP_INT_EPDISBLD;
      }
      else
      {
        USB->DIEP[epnum - 1].CTL = (USB->DIEP[epnum - 1].CTL & ~DEPCTL_WO_BITMASK) | USB_DIEP_CTL_SNAK | USB_DIEP_CTL_STALL;
      }

      /* Flush the FIFO */
      uint8_t const fifo_num = ((USB->DIEP[epnum - 1].CTL & _USB_DIEP_CTL_TXFNUM_MASK) >> _USB_DIEP_CTL_TXFNUM_SHIFT);
      flush_tx_fifo(fifo_num);
    }
  }
  else
  {
    if(epnum == 0)
    {
      USB->DOEP0CTL = (USB->DOEP0CTL & ~DEPCTL_WO_BITMASK) | USB_DIEP0CTL_STALL;
    }
    else
    {
      /* Only disable currently enabled non-control endpoint */
      if(USB->DOEP[epnum - 1].CTL & USB_DIEP_CTL_EPENA) 
      {
        /* Asserting GONAK is required to STALL an OUT endpoint. */
        USB->DCTL |= USB_DCTL_SGOUTNAK;
        while(!(USB->GINTSTS & USB_GINTSTS_GOUTNAKEFF));
        
        /* Disable the endpoint. Note that only STALL and not SNAK is set here. */
        USB->DOEP[epnum - 1].CTL = (USB->DOEP[epnum - 1].CTL & ~DEPCTL_WO_BITMASK) | USB_DIEP_CTL_EPDIS | USB_DIEP_CTL_STALL;
        while(USB->DOEP[epnum - 1].INT & USB_DIEP_INT_EPDISBLD);
        USB->DOEP[epnum - 1].INT |= USB_DIEP_INT_EPDISBLD;

        /* Allow other OUT endpoints to keep receiving. */
        USB->DCTL |= USB_DCTL_CGOUTNAK;
      }
      else
      {
        USB->DIEP[epnum - 1].CTL = (USB->DIEP[epnum - 1].CTL & ~DEPCTL_WO_BITMASK) | USB_DIEP_CTL_STALL;
      }
    }
  }
}

void dcd_edpt_clear_stall(uint8_t rhport, uint8_t ep_addr)
{
  (void) rhport;

  uint8_t const epnum = tu_edpt_number(ep_addr);
  uint8_t const dir = tu_edpt_dir(ep_addr);

  if(dir == TUSB_DIR_IN)
  {
    if(epnum == 0)
    {
      USB->DIEP0CTL &= ~(DEPCTL_WO_BITMASK | USB_DIEP0CTL_STALL);
    }
    else
    {
      USB->DIEP[epnum - 1].CTL &= ~(DEPCTL_WO_BITMASK | USB_DIEP_CTL_STALL);
    
      /* Required by USB spec to reset DATA toggle bit to DATA0 on interrupt and bulk endpoints. */
      uint8_t eptype = (USB->DIEP[epnum - 1].CTL & _USB_DIEP_CTL_EPTYPE_MASK) >> _USB_DIEP_CTL_EPTYPE_SHIFT;

      if((eptype == _USB_DIEP_CTL_EPTYPE_BULK) || (eptype == _USB_DIEP_CTL_EPTYPE_INT))
      {
        USB->DIEP[epnum - 1].CTL |= USB_DIEP_CTL_SETD0PIDEF;
      }
    }
  }
  else
  {
    if(epnum == 0)
    {
      USB->DOEP0CTL &= ~(DEPCTL_WO_BITMASK | USB_DOEP0CTL_STALL);
    }
    else
    {
      USB->DOEP[epnum - 1].CTL &= ~(DEPCTL_WO_BITMASK | USB_DOEP_CTL_STALL);
    
      /* Required by USB spec to reset DATA toggle bit to DATA0 on interrupt and bulk endpoints. */
      uint8_t eptype = (USB->DOEP[epnum - 1].CTL & _USB_DOEP_CTL_EPTYPE_MASK) >> _USB_DOEP_CTL_EPTYPE_SHIFT;

      if((eptype == _USB_DOEP_CTL_EPTYPE_BULK) || (eptype == _USB_DOEP_CTL_EPTYPE_INT))
      {
        USB->DOEP[epnum - 1].CTL |= USB_DOEP_CTL_SETD0PIDEF;
      }
    }
  }
}

bool dcd_edpt_open(uint8_t rhport, tusb_desc_endpoint_t const * p_endpoint_desc)
{
  (void)rhport;

  uint8_t const epnum = tu_edpt_number(p_endpoint_desc->bEndpointAddress);
  uint8_t const dir = tu_edpt_dir(p_endpoint_desc->bEndpointAddress);

  TU_ASSERT(epnum < EP_COUNT);
  TU_ASSERT(epnum != 0);

  xfer_ctl_t *xfer = XFER_CTL_BASE(epnum, dir);
  xfer->max_size = tu_edpt_packet_size(p_endpoint_desc);

