hathach/tinyusb/src/portable/silabs/efm32/dcd_efm32.c
  if(dir == TUSB_DIR_OUT)
  {
    USB->DOEP[epnum - 1].CTL |= USB_DOEP_CTL_USBACTEP |
                                (p_endpoint_desc->bmAttributes.xfer << _USB_DOEP_CTL_EPTYPE_SHIFT) |
                                (xfer->max_size << _USB_DOEP_CTL_MPS_SHIFT);
    USB->DAINTMSK |= (1 << (_USB_DAINTMSK_OUTEPMSK0_SHIFT + epnum));
  }
  else
  {
    uint8_t fifo_num = get_free_fifo();
    TU_ASSERT(fifo_num != 0);

    USB->DIEP[epnum - 1].CTL &= ~(_USB_DIEP_CTL_TXFNUM_MASK | _USB_DIEP_CTL_EPTYPE_MASK | USB_DIEP_CTL_SETD0PIDEF | _USB_DIEP_CTL_MPS_MASK);
    USB->DIEP[epnum - 1].CTL |= USB_DIEP_CTL_USBACTEP |
                                (fifo_num << _USB_DIEP_CTL_TXFNUM_SHIFT) |
                                (p_endpoint_desc->bmAttributes.xfer << _USB_DIEP_CTL_EPTYPE_SHIFT) |
                                ((p_endpoint_desc->bmAttributes.xfer != TUSB_XFER_ISOCHRONOUS) ? USB_DIEP_CTL_SETD0PIDEF : 0) |
                                (xfer->max_size << 0);

    USB->DAINTMSK |= (1 << epnum);

    /* Both TXFD and TXSA are in unit of 32-bit words. */
    /* IN FIFO 0 was configured during enumeration, hence the "+ 16". */
    uint16_t const allocated_size = (USB->GRXFSIZ & _USB_GRXFSIZ_RXFDEP_MASK) + 16;
    uint16_t const fifo_size = (EP_FIFO_SIZE/4 - allocated_size) / (EP_FIFO_NUM-1);
    uint32_t const fifo_offset = allocated_size + fifo_size*(fifo_num-1);

    /* DIEPTXF starts at FIFO #1. */
    volatile uint32_t* usb_dieptxf = &USB->DIEPTXF1;
    usb_dieptxf[epnum - 1] = (fifo_size << _USB_DIEPTXF1_INEPNTXFDEP_SHIFT) | fifo_offset;
  }
  return true;
}

void dcd_edpt_close_all (uint8_t rhport)
{
  (void) rhport;
  // TODO implement dcd_edpt_close_all()
}

bool dcd_edpt_xfer(uint8_t rhport, uint8_t ep_addr, uint8_t* buffer, uint16_t total_bytes)
{
  (void)rhport;

  uint8_t const epnum = tu_edpt_number(ep_addr);
  uint8_t const dir   = tu_edpt_dir(ep_addr);

  xfer_ctl_t * xfer = XFER_CTL_BASE(epnum, dir);
  xfer->buffer       = buffer;
  xfer->total_len    = total_bytes;
  xfer->queued_len   = 0;
  xfer->short_packet = false;

  uint16_t num_packets = (total_bytes / xfer->max_size);
  uint8_t short_packet_size = total_bytes % xfer->max_size;

  // Zero-size packet is special case.
  if(short_packet_size > 0 || (total_bytes == 0))
  {
    num_packets++;
  }

  // IN and OUT endpoint xfers are interrupt-driven, we just schedule them
  // here.
  if(dir == TUSB_DIR_IN)
  {
    if(epnum == 0)
    {
      // A full IN transfer (multiple packets, possibly) triggers XFRC.
      USB->DIEP0TSIZ = (num_packets << _USB_DIEP0TSIZ_PKTCNT_SHIFT) | total_bytes;
      USB->DIEP0CTL |= USB_DIEP0CTL_EPENA | USB_DIEP0CTL_CNAK; // Enable | CNAK
    }
    else
    {
      // A full IN transfer (multiple packets, possibly) triggers XFRC.
      USB->DIEP[epnum - 1].TSIZ = (num_packets << _USB_DIEP_TSIZ_PKTCNT_SHIFT) | total_bytes;
      USB->DIEP[epnum - 1].CTL |= USB_DIEP_CTL_EPENA | USB_DIEP_CTL_CNAK; // Enable | CNAK
    }
    
    // Enable fifo empty interrupt only if there are something to put in the fifo.
    if(total_bytes != 0)
    {
      USB->DIEPEMPMSK |= (1 << epnum);
    }
  }
  else
  {
    if(epnum == 0)
    {
      // A full IN transfer (multiple packets, possibly) triggers XFRC.
      USB->DOEP0TSIZ |= (1 << _USB_DOEP0TSIZ_PKTCNT_SHIFT) | ((xfer->max_size & _USB_DOEP0TSIZ_XFERSIZE_MASK) << _USB_DOEP0TSIZ_XFERSIZE_SHIFT);
      USB->DOEP0CTL |= USB_DOEP0CTL_EPENA | USB_DOEP0CTL_CNAK;
    }
    else
    {
      // A full IN transfer (multiple packets, possibly) triggers XFRC.
      USB->DOEP[epnum - 1].TSIZ |= (1 << _USB_DOEP_TSIZ_PKTCNT_SHIFT) | ((xfer->max_size & _USB_DOEP_TSIZ_XFERSIZE_MASK) << _USB_DOEP_TSIZ_XFERSIZE_SHIFT);
      USB->DOEP[epnum - 1].CTL |= USB_DOEP_CTL_EPENA | USB_DOEP_CTL_CNAK;
    }
  }
  return true;
}

/*------------------------------------------------------------------*/
/* IRQ                                                              */
/*------------------------------------------------------------------*/
void dcd_int_enable(uint8_t rhport)
{
  (void) rhport;

  NVIC_EnableIRQ(USB_IRQn);
}

void dcd_int_disable(uint8_t rhport)
{
  (void) rhport;

  NVIC_DisableIRQ(USB_IRQn);
}

static void receive_packet(xfer_ctl_t *xfer, uint16_t xfer_size)
{
  uint16_t remaining = xfer->total_len - xfer->queued_len;
  uint16_t to_recv_size;

  if(remaining <= xfer->max_size)
  {
    /* Avoid buffer overflow. */
    to_recv_size = (xfer_size > remaining) ? remaining : xfer_size;
  }
  else
  {
    /* Room for full packet, choose recv_size based on what the microcontroller claims. */
    to_recv_size = (xfer_size > xfer->max_size) ? xfer->max_size : xfer_size;
  }

  uint8_t to_recv_rem = to_recv_size % 4;
  uint16_t to_recv_size_aligned = to_recv_size - to_recv_rem;

  /* Do not assume xfer buffer is aligned. */
  uint8_t *base = (xfer->buffer + xfer->queued_len);

  /* This for loop always runs at least once- skip if less than 4 bytes to collect. */
  if(to_recv_size >= 4)
  {
    for(uint16_t i = 0; i < to_recv_size_aligned; i += 4)
    {
      uint32_t tmp = (*USB->FIFO0D);
      base[i] = tmp & 0x000000FF;
      base[i + 1] = (tmp & 0x0000FF00) >> 8;
      base[i + 2] = (tmp & 0x00FF0000) >> 16;
      base[i + 3] = (tmp & 0xFF000000) >> 24;
    }
  }

  /* Do not read invalid bytes from RX FIFO. */
  if(to_recv_rem != 0)
  {
    uint32_t tmp = (*USB->FIFO0D);
    uint8_t *last_32b_bound = base + to_recv_size_aligned;

    last_32b_bound[0] = tmp & 0x000000FF;
    if(to_recv_rem > 1)
    {
      last_32b_bound[1] = (tmp & 0x0000FF00) >> 8;
    }
    if(to_recv_rem > 2)
    {
      last_32b_bound[2] = (tmp & 0x00FF0000) >> 16;
    }
  }

  xfer->queued_len += xfer_size;

  /* Per USB spec, a short OUT packet (including length 0) is always */
  /* indicative of the end of a transfer (at least for ctl, bulk, int). */
  xfer->short_packet = (xfer_size < xfer->max_size);
}

static void transmit_packet(xfer_ctl_t *xfer, uint8_t fifo_num)
{
  uint16_t remaining;
  if(fifo_num == 0)
  {
    remaining = (USB->DIEP0TSIZ & 0x7FFFFU) >> _USB_DIEP0TSIZ_XFERSIZE_SHIFT;
  }
  else
  {
    remaining = (USB->DIEP[fifo_num - 1].TSIZ & 0x7FFFFU) >> _USB_DIEP_TSIZ_XFERSIZE_SHIFT;
  }
  xfer->queued_len = xfer->total_len - remaining;

  uint16_t to_xfer_size = (remaining > xfer->max_size) ? xfer->max_size : remaining;
  uint8_t to_xfer_rem = to_xfer_size % 4;
  uint16_t to_xfer_size_aligned = to_xfer_size - to_xfer_rem;

  /* Buffer might not be aligned to 32b, so we need to force alignment by copying to a temp var. */
  uint8_t *base = (xfer->buffer + xfer->queued_len);

  /* This for loop always runs at least once- skip if less than 4 bytes to send off. */
  if(to_xfer_size >= 4)
  {
    for(uint16_t i = 0; i < to_xfer_size_aligned; i += 4)
    {
      uint32_t tmp = base[i] | (base[i + 1] << 8) | (base[i + 2] << 16) | (base[i + 3] << 24);
      *tx_fifo[fifo_num] = tmp;
    }
  }

  /* Do not read beyond end of buffer if not divisible by 4. */
  if(to_xfer_rem != 0)
  {
    uint32_t tmp = 0;
    uint8_t *last_32b_bound = base + to_xfer_size_aligned;

