hathach/tinyusb/src/portable/silabs/efm32/dcd_efm32.c
    tmp |= last_32b_bound[0];
    if(to_xfer_rem > 1)
    {
      tmp |= (last_32b_bound[1] << 8);
    }
    if(to_xfer_rem > 2)
    {
      tmp |= (last_32b_bound[2] << 16);
    }

    *tx_fifo[fifo_num] = tmp;
  }
}

static void read_rx_fifo(void)
{
  /*
   * Pop control word off FIFO (completed xfers will have 2 control words,
   * we only pop one ctl word each interrupt).
   */
  uint32_t const ctl_word = USB->GRXSTSP;
  uint8_t  const pktsts   = (ctl_word & _USB_GRXSTSP_PKTSTS_MASK) >> _USB_GRXSTSP_PKTSTS_SHIFT;
  uint8_t  const epnum    = (ctl_word & _USB_GRXSTSP_CHNUM_MASK ) >> _USB_GRXSTSP_CHNUM_SHIFT;
  uint16_t const bcnt     = (ctl_word & _USB_GRXSTSP_BCNT_MASK  ) >> _USB_GRXSTSP_BCNT_SHIFT;

  switch(pktsts)
  {
    case 0x01: /* Global OUT NAK (Interrupt) */
      break;

    case 0x02:
    { 
      /* Out packet recvd */
      xfer_ctl_t *xfer = XFER_CTL_BASE(epnum, TUSB_DIR_OUT);
      receive_packet(xfer, bcnt);
    }
    break;

    case 0x03:
      /* Out packet done (Interrupt) */
      break;

    case 0x04: 
      /* Step 2: Setup transaction completed (Interrupt) */
      /* After this event, OEPINT interrupt will occur with SETUP bit set */
      if(epnum == 0)
      {
        USB->DOEP0TSIZ |= (1 << _USB_DOEP0TSIZ_SUPCNT_SHIFT);
      }
      
      break;

    case 0x06:
    { 
      /* Step1: Setup data packet received */

      /*
       * We can receive up to three setup packets in succession, but
       * only the last one is valid. Therefore we just overwrite it
       */
      _setup_packet[0] = (*USB->FIFO0D);
      _setup_packet[1] = (*USB->FIFO0D);
    }
    break;

    default: 
      /* Invalid, breakpoint. */
      TU_BREAKPOINT();
      break;
  }
}

static void handle_epout_ints(void)
{
  // GINTSTS will be cleared with DAINT == 0
  // DAINT for a given EP clears when DOEPINTx is cleared.
  // DOEPINT will be cleared when DAINT's out bits are cleared.

  for(uint8_t n = 0; n < EP_COUNT; n++)
  {
    xfer_ctl_t *xfer = XFER_CTL_BASE(n, TUSB_DIR_OUT);

    if(n == 0)
    {
      if(USB->DAINT & (1 << (_USB_DAINT_OUTEPINT0_SHIFT + n)))
      {
        // SETUP packet Setup Phase done.
        if((USB->DOEP0INT & USB_DOEP0INT_SETUP))
        {
          USB->DOEP0INT = USB_DOEP0INT_STUPPKTRCVD | USB_DOEP0INT_SETUP; // clear
          dcd_event_setup_received(0, (uint8_t *)&_setup_packet[0], true);
        }

        // OUT XFER complete (single packet).q
        if(USB->DOEP0INT & USB_DOEP0INT_XFERCOMPL)
        {
          USB->DOEP0INT = USB_DOEP0INT_XFERCOMPL;

          // Transfer complete if short packet or total len is transferred
          if(xfer->short_packet || (xfer->queued_len == xfer->total_len))
          {
            xfer->short_packet = false;
            dcd_event_xfer_complete(0, n, xfer->queued_len, XFER_RESULT_SUCCESS, true);
          }
          else
          {
            // Schedule another packet to be received.
            USB->DOEP0TSIZ |= (1 << _USB_DOEP0TSIZ_PKTCNT_SHIFT) | ((xfer->max_size & _USB_DOEP0TSIZ_XFERSIZE_MASK) << _USB_DOEP0TSIZ_XFERSIZE_SHIFT);
            USB->DOEP0CTL |= USB_DOEP0CTL_EPENA | USB_DOEP0CTL_CNAK;
          }
        }
      }
    }
    else
    {
      if(USB->DAINT & (1 << (_USB_DAINT_OUTEPINT0_SHIFT + n)))
      {
        // SETUP packet Setup Phase done.
        if((USB->DOEP[n - 1].INT & USB_DOEP_INT_SETUP))
        {
          USB->DOEP[n - 1].INT = USB_DOEP_INT_STUPPKTRCVD | USB_DOEP_INT_SETUP; // clear
          dcd_event_setup_received(0, (uint8_t *)&_setup_packet[0], true);
        }

        // OUT XFER complete (single packet).q
        if(USB->DOEP[n - 1].INT & USB_DOEP_INT_XFERCOMPL)
        {
          USB->DOEP[n - 1].INT = USB_DOEP_INT_XFERCOMPL;

          // Transfer complete if short packet or total len is transferred
          if(xfer->short_packet || (xfer->queued_len == xfer->total_len))
          {
            xfer->short_packet = false;
            dcd_event_xfer_complete(0, n, xfer->queued_len, XFER_RESULT_SUCCESS, true);
          }
          else
          {
            // Schedule another packet to be received.
            USB->DOEP[n - 1].TSIZ |= (1 << _USB_DOEP_TSIZ_PKTCNT_SHIFT) | ((xfer->max_size & _USB_DOEP_TSIZ_XFERSIZE_MASK) << _USB_DOEP_TSIZ_XFERSIZE_SHIFT);
            USB->DOEP[n - 1].CTL |= USB_DOEP_CTL_EPENA | USB_DOEP_CTL_CNAK;
          }
        }
      }
    }
  }
}

static void handle_epin_ints(void)
{

  for(uint32_t n = 0; n < EP_COUNT; n++)
  {
    xfer_ctl_t *xfer = &xfer_status[n][TUSB_DIR_IN];

    if(n == 0)
    {
      if(USB->DAINT & (1 << n))
      {
        /* IN XFER complete (entire xfer). */
        if(USB->DIEP0INT & USB_DIEP0INT_XFERCOMPL)
        {
          USB->DIEP0INT = USB_DIEP0INT_XFERCOMPL;
          dcd_event_xfer_complete(0, n | TUSB_DIR_IN_MASK, xfer->total_len, XFER_RESULT_SUCCESS, true);
        }

        /* XFER FIFO empty */
        if(USB->DIEP0INT & USB_DIEP0INT_TXFEMP)
        {
          USB->DIEP0INT = USB_DIEP0INT_TXFEMP;
          transmit_packet(xfer, n);

          /* Turn off TXFE if all bytes are written. */
          if(xfer->queued_len == xfer->total_len)
          {
            USB->DIEPEMPMSK  &= ~(1 << n);
          }
        }

        /* XFER Timeout */
        if(USB->DIEP0INT & USB_DIEP0INT_TIMEOUT)
        {
          /* Clear interrupt or enpoint will hang. */
          USB->DIEP0INT = USB_DIEP0INT_TIMEOUT;
        }
      }
    }
    else
    {
      if(USB->DAINT & (1 << n))
      {
        /* IN XFER complete (entire xfer). */
        if(USB->DIEP[n - 1].INT & USB_DIEP_INT_XFERCOMPL)
        {
          USB->DIEP[n - 1].INT = USB_DIEP_INT_XFERCOMPL;
          dcd_event_xfer_complete(0, n | TUSB_DIR_IN_MASK, xfer->total_len, XFER_RESULT_SUCCESS, true);
        }

        /* XFER FIFO empty */
        if(USB->DIEP[n - 1].INT & USB_DIEP_INT_TXFEMP)
        {
          USB->DIEP[n - 1].INT = USB_DIEP_INT_TXFEMP;
          transmit_packet(xfer, n);

          /* Turn off TXFE if all bytes are written. */
          if(xfer->queued_len == xfer->total_len)
          {
            USB->DIEPEMPMSK  &= ~(1 << n);
          }
        }

        /* XFER Timeout */
        if(USB->DIEP[n - 1].INT & USB_DIEP_INT_TIMEOUT)
        {
          /* Clear interrupt or enpoint will hang. */
          USB->DIEP[n - 1].INT = USB_DIEP_INT_TIMEOUT;
        }
      }
    }
  }
}

void dcd_int_handler(uint8_t rhport)
{
  (void) rhport;

  const uint32_t int_status = USB->GINTSTS;

