hathach/tinyusb/src/portable/silabs/efm32/dcd_efm32.c
  /* USB Reset */
  if(int_status & USB_GINTSTS_USBRST)
  {
    /* start of reset */
    USB->GINTSTS = USB_GINTSTS_USBRST;
    /* FIFOs will be reassigned when the endpoints are reopen */
    _allocated_fifos = 1;
    bus_reset();
  }

  /* Reset detected Interrupt */
  if(int_status & USB_GINTSTS_RESETDET)
  {
    USB->GINTSTS = USB_GINTSTS_RESETDET;
    bus_reset();
  }

  /* Enumeration Done */
  if(int_status & USB_GINTSTS_ENUMDONE)
  {
    /* This interrupt is considered the end of reset. */
    USB->GINTSTS = USB_GINTSTS_ENUMDONE;
    enum_done_processing();
    dcd_event_bus_signal(0, DCD_EVENT_BUS_RESET, true);
  }

  /* OTG Interrupt */
  if(int_status & USB_GINTSTS_OTGINT)
  {
    /* OTG INT bit is read-only */

    uint32_t const otg_int = USB->GOTGINT;

    if(otg_int & USB_GOTGINT_SESENDDET)
    {
      dcd_event_bus_signal(0, DCD_EVENT_UNPLUGGED, true);
    }

    USB->GOTGINT = otg_int;
  }

  #if USE_SOF
  if(int_status & USB_GINTSTS_SOF)
  {
    USB->GINTSTS = USB_GINTSTS_SOF;
    dcd_event_bus_signal(0, DCD_EVENT_SOF, true);
  }
  #endif

  /* RxFIFO Non-Empty */
  if(int_status & USB_GINTSTS_RXFLVL)
  {
    /* RXFLVL bit is read-only */

    /* Mask out RXFLVL while reading data from FIFO */
    USB->GINTMSK &= ~USB_GINTMSK_RXFLVLMSK;
    read_rx_fifo();
    USB->GINTMSK |= USB_GINTMSK_RXFLVLMSK;
  }

  /* OUT Endpoints Interrupt */
  if(int_status & USB_GINTMSK_OEPINTMSK)
  {
    /* OEPINT is read-only */
    handle_epout_ints();
  }

  /* IN Endpoints Interrupt */
  if(int_status & USB_GINTMSK_IEPINTMSK)
  {
    /* IEPINT bit read-only */
    handle_epin_ints();
  }

  /* unhandled */
  USB->GINTSTS |= USB_GINTSTS_CURMOD      |
                  USB_GINTSTS_MODEMIS     |
                  USB_GINTSTS_OTGINT      |
                  USB_GINTSTS_NPTXFEMP    |
                  USB_GINTSTS_GINNAKEFF   |
                  USB_GINTSTS_GOUTNAKEFF  |
                  USB_GINTSTS_ERLYSUSP    |
                  USB_GINTSTS_USBSUSP     |
                  USB_GINTSTS_ISOOUTDROP  |
                  USB_GINTSTS_EOPF        |
                  USB_GINTSTS_EPMIS       |
                  USB_GINTSTS_INCOMPISOIN |
                  USB_GINTSTS_INCOMPLP    |
                  USB_GINTSTS_FETSUSP     |
                  USB_GINTSTS_PTXFEMP;
}

#endif
